import Footer from '@/components/Footer';
import Delimiter from '@/components/static/Delimiter'
import FrequentlyAskedQuestion from '@/components/static/FrequentlyAskedQuestion'
import React from 'react'

interface QnA {
    question: string;
    answer: string;
}

const faq: Array<QnA> = [
    {
        question: "Как се формира рейтингът на филмите?",
        answer: "Рейтингът на всеки филм се изчислява като средна оценка от оценките на всички потребители."
    },
    {
        question: "Откъде се взима информацията за филмите?",
        answer: "Информацията се съхранява в собствената ни детайлна база от данни, като се стремим да предоставим максимално пълна и актуална информация за всяко заглавие."
    },
    {
        question: "Мога ли да филтрирам филми по специфични критерии (година, жанр, рейтинг, държава)?",
        answer: "Над списъка с резултати от търсене ще откриете бутон за форма с филтри, която дава пълен контрол да подберете подходящи за вас филми."
    },
    {
        question: "Има ли мобилно приложение или сайтът е оптимизиран за телефони?",
        answer: "Към момента се фокусираме върху пълното оптимизиране на уеб версията, с цел да осигурим отлично преживяване на всяко устройство."
    },
    {
        question: "Как да намеря къде се излъчва даден филм (Netflix, HBO, Disney+)?",
        answer: "При отваряне на страницата на определен филм, има бутон \"Stream Now\", който пренасочва към платформите, в които е наличен за гледане."
    },
    {
        question: "Предлага ли сайтът персонализирани препоръки на базата на историята на моето гледане?",
        answer: "Към този момент не се предлагат индивидуални препоръки, но активно работим по внедряването на система, която да ви помага в откриването на нови заглавия на базата на вашите предпочитания."
    },
    {
        question: "Има ли „Тъмен режим“ (Dark Mode) на сайта?",
        answer: "Настоящият дизайн е оптимизиран с тъмни тонове, за да е максимално удобен за гледане на трейлъри и снимки. Въпреки това планираме да добавим специален тъмен режим в бъдещите версии."
    },
    {
        question: "Как мога да видя кои филми излизат в кината тази седмица?",
        answer: "Можете да следите всички нови заглавия в секцията \"Upcoming\" на началната страница. Там ще да намерите актуален списък със заглавия, престоящи да излязат на голям екран в най-скоро време."
    },
    {
        question: "Има ли опция за „Рандом филм“, ако не знам какво ми се гледа?",
        answer: "Има опция за избор на произволен филм. Тя се намира в страничното меню, което се отваря от навигационната лента."
    },
    {
        question: "Поддържа ли сайтът различни езици за имената на филмите?",
        answer: "Към момента заглавията са представени на оригиналния им език (английски), за да се избегнат неточности при превода. Активно планираме добавянето на преводи и на други езици, с целта сайтът ни да е максимално достъпен за международната ни аудиторията."
    }
]

const page = () => {
    return (
        <div className="w-full text-white flex flex-col items-center gap-y-28 mt-20">
            <div className="w-full flex flex-col items-center gap-y-28">
                <div className="text-5xl font-bold">Frequently Asked Questions</div>
                <div className="w-full flex flex-col items-center gap-y-16">
                    {
                        faq.map((qna, index) => {
                            return <div
                                key={index}
                                className="w-full flex flex-col items-center justify-center gap-y-16">
                                <FrequentlyAskedQuestion
                                    question={qna.question}
                                    answer={qna.answer}
                                />
                                {index < faq.length - 1 ? <Delimiter /> : ""}
                            </div>
                        })
                    }
                </div>
            </div>
            <Footer />
        </div>
    )
}

export default page